// ステージ17 よあけの おおさそり: オレンジ〜あかちゃの こうら。しっぽの つき・すなに もぐる
export const BOSS = {
  id: 'sunscorp', color: 0xff7a20, shotColor: 0xffa040, fxColor: 0xd8b070, scale: 1.9,
  look: { id: 'sunscorp', colors: { skin: 0xa8501c, shirt: 0xc86a24, pants: 0x7a3a14, emissive: 0x241004 }, parts: [
    ['body', 0xd87a2c, 0.62, 0.5, 0.4, 0, 0.5, 0.04],
    ['body', 0x8a3c12, 0.5, 0.1, 0.34, 0, 0.8, 0.04],
    ['body', 0xc86a24, 0.5, 0.5, 0.2, 0, 0.5, 0.3],
    ['body', 0xc86a24, 0.2, 0.2, 0.2, 0, 0.9, 0.42],
    ['body', 0xc86a24, 0.2, 0.2, 0.2, 0, 1.1, 0.62, { r: [0.6, 0, 0] }],
    ['body', 0xc86a24, 0.2, 0.2, 0.2, 0, 1.2, 0.35, { r: [-0.5, 0, 0] }],
    ['body', 0xc86a24, 0.2, 0.4, 0.2, 0, 1.45, 0.1, { r: [-0.4, 0, 0] }],
    ['body', 0xffe060, 0.08, 0.26, 0.08, 0, 1.58, -0.08, { glow: true, r: [-0.9, 0, 0] }],
    ['body', 0xa8501c, 0.24, 0.24, 0.7, -0.46, 0.48, -0.5],
    ['body', 0xa8501c, 0.24, 0.24, 0.7, 0.46, 0.48, -0.5],
    ['body', 0xe08a30, 0.34, 0.2, 0.3, -0.5, 0.48, -0.95, { r: [0, 0.4, 0] }],
    ['body', 0xe08a30, 0.34, 0.2, 0.3, 0.5, 0.48, -0.95, { r: [0, -0.4, 0] }],
    ['head', 0xd87a2c, 0.56, 0.4, 0.52, 0, 0.2, 0],
    ['head', 0xff4a1a, 0.1, 0.1, 0.05, -0.14, 0.26, -0.27, { glow: true }],
    ['head', 0xff4a1a, 0.1, 0.1, 0.05, 0.14, 0.26, -0.27, { glow: true }],
    ['inner', 0x7a3a14, 0.14, 0.5, 0.14, -0.4, 0.2, 0.2, { r: [0, 0, 0.5] }],
    ['inner', 0x7a3a14, 0.14, 0.5, 0.14, 0.4, 0.2, 0.2, { r: [0, 0, -0.5] }],
  ] },
  moves: [
    { id: 'sting', kind: 'line', tele: 1.0, len: 8, w: 1.6, dmg: 18, fxColor: 0xd8b070, range: [0, 8], cd: 4 },
    { id: 'dive', kind: 'pounce', hide: 1.2, tele: 0.9, r: 2.4, dmg: 20, fxColor: 0xd8b070, range: [4, 22], cd: 7 },
  ],
};
